noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/timer.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2011, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//timer.c - Driver for the TIMER Module.
//
//*****************************************************************************
#include "inc/hw_types.h"
#include "driverlib/5xx_6xx/debug.h"
#include "driverlib/5xx_6xx/timer.h"
#include "msp430xgeneric.h"

void privateTimerProcessClockSourceDivider (unsigned int baseAddress,
    unsigned int clockSourceDivider);

//*****************************************************************************
//
//! Starts timer in continuous mode.
//!
//! \param baseAddress is the base address of the Timer module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_CLOCKSOURCE_ACLK
//!         \b TIMER_CLOCKSOURCE_SMCLK
//!         \b TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TAIE is to enable or disable timer interrupt
//!        Valid values are
//!        \b TIMER_TAIE_INTERRUPT_ENABLE
//!        \b TIMER_TAIE_INTERRUPT_DISABLE [Default value]
//! \param timerclear decides if timer clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_DO_CLEAR
//!        \b TIMER_SKIP_CLEAR [Default value]
//!
//! Modified reister is \b TAxCTL
//!
//! \return NONE
//
//*****************************************************************************
void Timer_startContinousMode ( unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerInterruptEnable_TAIE,
    unsigned int timerclear
    )
{
    ASSERT(
        (TIMER_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_DO_CLEAR == timerclear) ||
        (TIMER_SKIP_CLEAR == timerclear)
        );

    ASSERT(
        (TIMER_TAIE_INTERRUPT_ENABLE == timerInterruptEnable_TAIE) ||
        (TIMER_TAIE_INTERRUPT_DISABLE == timerInterruptEnable_TAIE)
        );

    ASSERT(
        (TIMER_CLOCKSOURCE_DIVIDER_1 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_2 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_4 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_8 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_3 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_5 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_6 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_7 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_10 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_12 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_14 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_16 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_20 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_24 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_28 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_32 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_40 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_48 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_56 == clockSourceDivider) ||
        (TIMER_CLOCKSOURCE_DIVIDER_64 == clockSourceDivider)
        );


    privateTimerProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

