noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/timer.c
    HWREG(baseAddress +
        OFS_TAxCTL) &= ~(TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
                         TIMER_UPDOWN_MODE +
                         TIMER_DO_CLEAR +
                         TIMER_TAIE_INTERRUPT_ENABLE
                         );

    HWREG(baseAddress + OFS_TAxCTL)  |= ( clockSource + TIMER_CONTINUOUS_MODE +
                                          timerclear +
                                          timerInterruptEnable_TAIE);
}

//*****************************************************************************
//
//! Starts timer in up mode.
//!
//! \param baseAddress is the base address of the Timer module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_CLOCKSOURCE_ACLK
//!         \b TIMER_CLOCKSOURCE_SMCLK
//!         \b TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod is the specified timer period
//! \param timerInterruptEnable_TAIE is to enable or disable timer interrupt
//!        Valid values are
//!        \b TIMER_TAIE_INTERRUPT_ENABLE and
//!        \b TIMER_TAIE_INTERRUPT_DISABLE [Default value]
//! \param captureCompareInterruptEnable_CCR0_CCIE is to enable or disable
//!         timer CCR0 captureComapre interrupt. Valid values are
//!        \b TIMER_CCIE_CCR0_INTERRUPT_ENABLE and
//!        \b TIMER_CCIE_CCR0_INTERRUPT_DISABLE [Default value]
//! \param timerclear decides if timer clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_DO_CLEAR
//!        \b TIMER_SKIP_CLEAR [Default value]
//!
//! Modified registers are  \b TAxCTL, \b TAxCCR0, \b TAxCCTL0
//!
//! \return NONE
//
//*****************************************************************************
void Timer_startUpMode (   unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerPeriod,
    unsigned int timerInterruptEnable_TAIE,
    unsigned int captureCompareInterruptEnable_CCR0_CCIE,
    unsigned int timerclear
    )
{
    ASSERT(
        (TIMER_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_DO_CLEAR == timerclear) ||
        (TIMER_SKIP_CLEAR == timerclear)
        );

    ASSERT(
        (TIMER_DO_CLEAR == timerclear) ||
        (TIMER_SKIP_CLEAR == timerclear)
        );

    privateTimerProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

    HWREG(baseAddress + OFS_TAxCTL) &=
        ~(TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
          TIMER_UPDOWN_MODE +
          TIMER_DO_CLEAR +
          TIMER_TAIE_INTERRUPT_ENABLE
          );

    HWREG(baseAddress + OFS_TAxCTL)  |= ( clockSource +
                                          TIMER_UP_MODE +
                                          timerclear +
                                          timerInterruptEnable_TAIE
                                          );

    if (TIMER_CCIE_CCR0_INTERRUPT_ENABLE ==
        captureCompareInterruptEnable_CCR0_CCIE){
        HWREG(baseAddress + OFS_TAxCCTL0)  |= TIMER_CCIE_CCR0_INTERRUPT_ENABLE;
    } else   {
        HWREG(baseAddress + OFS_TAxCCTL0)  &= ~TIMER_CCIE_CCR0_INTERRUPT_ENABLE;
    }

    HWREG(baseAddress + OFS_TAxCCR0)  = timerPeriod;
}

//*****************************************************************************
//
//! Starts timer in up down mode.
//!
//! \param baseAddress is the base address of the Timer module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_CLOCKSOURCE_EXTERNAL_TXCLK [Default value]
//!         \b TIMER_CLOCKSOURCE_ACLK
//!         \b TIMER_CLOCKSOURCE_SMCLK
//!         \b TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_CLOCKSOURCE_DIVIDER_1 [Default value]
//!        \b TIMER_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod is the specified timer period
//! \param timerInterruptEnable_TAIE is to enable or disable timer interrupt
//!        Valid values are
//!        \b TIMER_TAIE_INTERRUPT_ENABLE
//!        \b TIMER_TAIE_INTERRUPT_DISABLE [Default value]
//! \param captureCompareInterruptEnable_CCR0_CCIE is to enable or disable
//!         timer CCR0 captureComapre interrupt. Valid values are
//!        \b TIMER_CCIE_CCR0_INTERRUPT_ENABLE and
//!        \b TIMER_CCIE_CCR0_INTERRUPT_DISABLE [Default value]
//! \param timerclear decides if timer clock divider, count direction, count
//!        need to be reset. Valid values are
//!        \b TIMER_DO_CLEAR
//!        \b TIMER_SKIP_CLEAR [Default value]
//!
//! Modified registers are  \b TAxCTL, \b TAxCCR0, \b TAxCCTL0
//!
//! \return NONE
//
//*****************************************************************************
void Timer_startUpDownMode (
    unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerPeriod,
    unsigned int timerInterruptEnable_TAIE,
    unsigned int captureCompareInterruptEnable_CCR0_CCIE,
    unsigned int timerclear
    )
{
    ASSERT(
        (TIMER_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT(
        (TIMER_DO_CLEAR == timerclear) ||
        (TIMER_SKIP_CLEAR == timerclear)
        );

    ASSERT(
        (TIMER_DO_CLEAR == timerclear) ||
        (TIMER_SKIP_CLEAR == timerclear)
        );

    privateTimerProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

    HWREG(baseAddress + OFS_TAxCTL) &=
        ~(TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
          TIMER_UPDOWN_MODE +
          TIMER_DO_CLEAR +
          TIMER_TAIE_INTERRUPT_ENABLE
          );

    HWREG(baseAddress + OFS_TAxCTL)  |= ( clockSource +
                                          TIMER_UPDOWN_MODE +
                                          timerclear +
                                          timerInterruptEnable_TAIE
                                          );
    if (TIMER_CCIE_CCR0_INTERRUPT_ENABLE ==
        captureCompareInterruptEnable_CCR0_CCIE){
        HWREG(baseAddress + OFS_TAxCCTL0)  |= TIMER_CCIE_CCR0_INTERRUPT_ENABLE;
    } else   {
        HWREG(baseAddress + OFS_TAxCCTL0)  &= ~TIMER_CCIE_CCR0_INTERRUPT_ENABLE;
    }

