noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/timer.c
    HWREG(baseAddress + OFS_TAxCCR0)  = timerPeriod;
}

//*****************************************************************************
//
//! Initializes Capture Mode
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param captureMode is the capture mode selected. Valid values are
//!        \b TIMER_CAPTUREMODE_NO_CAPTURE [Default value]
//!        \b TIMER_CAPTUREMODE_RISING_EDGE
//!        \b TIMER_CAPTUREMODE_FALLING_EDGE
//!        \b TIMER_CAPTUREMODE_RISING_AND_FALLING_EDGE
//! \param captureInputSelect decides the Input Select
//!        \b TIMER_CAPTURE_INPUTSELECT_CCIxA [Default value]
//!        \b TIMER_CAPTURE_INPUTSELECT_CCIxB
//!        \b TIMER_CAPTURE_INPUTSELECT_GND
//!        \b TIMER_CAPTURE_INPUTSELECT_Vcc
//! \param synchronizeCaptureSource decides if capture source should be
//!         synchronized with timer clock
//!        Valid values are
//!        \b TIMER_CAPTURE_ASYNCHRONOUS [Default value]
//!        \b TIMER_CAPTURE_SYNCHRONOUS
//! \param captureInterruptEnable is to enable or disable
//!         timer captureComapre interrupt. Valid values are
//!        \b TIMER_CAPTURECOMPARE_INTERRUPT_DISABLE [Default value]
//!        \b TIMER_CAPTURECOMPARE_INTERRUPT_ENABLE
//! \param captureOutputMode specifies the ouput mode. Valid values are
//!        \b TIMER_OUTPUTMODE_OUTBITVALUE [Default value],
//!        \b TIMER_OUTPUTMODE_SET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_RESET,
//!        \b TIMER_OUTPUTMODE_SET_RESET
//!        \b TIMER_OUTPUTMODE_TOGGLE,
//!        \b TIMER_OUTPUTMODE_RESET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_SET,
//!        \b TIMER_OUTPUTMODE_RESET_SET
//!
//! Modified register is \b TAxCCTLn
//! \return NONE
//
//*****************************************************************************
void Timer_initCapture (unsigned int baseAddress,
    unsigned int captureRegister,
    unsigned int captureMode,
    unsigned int captureInputSelect,
    unsigned short synchronizeCaptureSource,
    unsigned short captureInterruptEnable,
    unsigned int captureOutputMode
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == captureRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == captureRegister) 
        );

    ASSERT((TIMER_CAPTUREMODE_NO_CAPTURE == captureMode) ||
        (TIMER_CAPTUREMODE_RISING_EDGE == captureMode) ||
        (TIMER_CAPTUREMODE_FALLING_EDGE == captureMode) ||
        (TIMER_CAPTUREMODE_RISING_AND_FALLING_EDGE == captureMode)
        );

    ASSERT((TIMER_CAPTURE_INPUTSELECT_CCIxA == captureInputSelect) ||
        (TIMER_CAPTURE_INPUTSELECT_CCIxB == captureInputSelect) ||
        (TIMER_CAPTURE_INPUTSELECT_GND == captureInputSelect) ||
        (TIMER_CAPTURE_INPUTSELECT_Vcc == captureInputSelect)
        );

    ASSERT((TIMER_CAPTURE_ASYNCHRONOUS == synchronizeCaptureSource) ||
        (TIMER_CAPTURE_SYNCHRONOUS == synchronizeCaptureSource)
        );

    ASSERT(
        (TIMER_CAPTURECOMPARE_INTERRUPT_DISABLE == captureInterruptEnable) ||
        (TIMER_CAPTURECOMPARE_INTERRUPT_ENABLE == captureInterruptEnable)
        );

    ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE == captureOutputMode) ||
        (TIMER_OUTPUTMODE_SET == captureOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_RESET == captureOutputMode) ||
        (TIMER_OUTPUTMODE_SET_RESET == captureOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE == captureOutputMode) ||
        (TIMER_OUTPUTMODE_RESET == captureOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_SET == captureOutputMode) ||
        (TIMER_OUTPUTMODE_RESET_SET == captureOutputMode)
        );

    if (TIMER_CAPTURECOMPARE_REGISTER_0 == captureRegister){
        //CaptureCompare register 0 only supports certain modes
        ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE == captureOutputMode) ||
            (TIMER_OUTPUTMODE_SET == captureOutputMode) ||
            (TIMER_OUTPUTMODE_TOGGLE == captureOutputMode) ||
            (TIMER_OUTPUTMODE_RESET == captureOutputMode) 
            );
    }

    HWREG(baseAddress + captureRegister ) |=   CAP;

    HWREG(baseAddress + captureRegister) &=
        ~(TIMER_CAPTUREMODE_RISING_AND_FALLING_EDGE +
          TIMER_CAPTURE_INPUTSELECT_Vcc +
          TIMER_CAPTURE_SYNCHRONOUS +
          TIMER_DO_CLEAR +
          TIMER_TAIE_INTERRUPT_ENABLE +
          CM_3
          );

    HWREG(baseAddress + captureRegister)  |= (captureMode +
                                              captureInputSelect +
                                              synchronizeCaptureSource +
                                              captureInterruptEnable +
                                              captureOutputMode
                                              );
}

//*****************************************************************************
//
//! Initializes Compare Mode
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareInterruptEnable is to enable or disable
//!         timer captureComapre interrupt. Valid values are
//!        \b TIMER_CAPTURECOMPARE_INTERRUPT_ENABLE and
//!        \b TIMER_CAPTURECOMPARE_INTERRUPT_DISABLE [Default value]
//! \param compareOutputMode specifies the ouput mode. Valid values are
//!        \b TIMER_OUTPUTMODE_OUTBITVALUE [Default value],
//!        \b TIMER_OUTPUTMODE_SET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_RESET,
//!        \b TIMER_OUTPUTMODE_SET_RESET
//!        \b TIMER_OUTPUTMODE_TOGGLE,
//!        \b TIMER_OUTPUTMODE_RESET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_SET,
//!        \b TIMER_OUTPUTMODE_RESET_SET
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified register is \b TAxCCTLn and \b TAxCCRn
//! \return NONE
//
//*****************************************************************************
void Timer_initCompare (  unsigned int baseAddress,
    unsigned int compareRegister,
    unsigned short compareInterruptEnable,
    unsigned int compareOutputMode,
    unsigned int compareValue
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == compareRegister) 
        );

   ASSERT((TIMER_CAPTURECOMPARE_INTERRUPT_ENABLE == compareInterruptEnable) ||
        (TIMER_CAPTURECOMPARE_INTERRUPT_DISABLE == compareInterruptEnable)
        );

    ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
        (TIMER_OUTPUTMODE_SET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_SET_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE == compareOutputMode) ||
        (TIMER_OUTPUTMODE_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_SET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_RESET_SET == compareOutputMode)
        );

    if (TIMER_CAPTURECOMPARE_REGISTER_0 == compareRegister){
        //CaptureCompare register 0 only supports certain modes
        ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
            (TIMER_OUTPUTMODE_SET == compareOutputMode) ||
            (TIMER_OUTPUTMODE_TOGGLE == compareOutputMode) ||
            (TIMER_OUTPUTMODE_RESET == compareOutputMode) 
            );
    }


    HWREG(baseAddress + compareRegister ) &=   ~CAP;

