noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/timer.c
    ASSERT((TIMER_READ_CAPTURE_COMPARE_INPUT == synchronized) ||
        (TIMER_READ_SYNCHRONIZED_CAPTURECOMPAREINPUT == synchronized)
        );

    if (HWREG(baseAddress + captureCompareRegister) & synchronized){
        return ( TIMER_CAPTURECOMPARE_INPUT_HIGH) ;
    } else   {
        return ( TIMER_CAPTURECOMPARE_INPUT_LOW) ;
    }
}

//*****************************************************************************
//
//! Get ouput bit for output mode
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! \return \b TIMER_OUTPUTMODE_OUTBITVALUE_HIGH or
//!         \b TIMER_OUTPUTMODE_OUTBITVALUE_LOW
//
//*****************************************************************************
unsigned char Timer_getOutputForOutputModeOutBitValue
    (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister) 
        );

    if (HWREG(baseAddress + captureCompareRegister) & OUT){
        return ( TIMER_OUTPUTMODE_OUTBITVALUE_HIGH) ;
    } else   {
        return ( TIMER_OUTPUTMODE_OUTBITVALUE_LOW) ;
    }
}

//*****************************************************************************
//
//! Get current capturecompare count
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! \return current count as unsigned int
//
//*****************************************************************************
unsigned int Timer_getCaptureCompareCount
    (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
        );

    return  (HWREG(baseAddress + OFS_TAxR + captureCompareRegister));
}

//*****************************************************************************
//
//! Set ouput bit for output mode
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param outputModeOutBitValueis the value to be set for out bit
//!     Valid values are \b TIMER_OUTPUTMODE_OUTBITVALUE_HIGH
//!                      \b TIMER_OUTPUTMODE_OUTBITVALUE_LOW
//!
//! Modified register is \b TAxCCTLn
//!
//! \return NONE
//
//*****************************************************************************
void Timer_setOutputForOutputModeOutBitValue
    (unsigned int baseAddress,
    unsigned int captureCompareRegister,
    unsigned char outputModeOutBitValue
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister) 
        );

    ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE_HIGH == outputModeOutBitValue) ||
        (TIMER_OUTPUTMODE_OUTBITVALUE_LOW == outputModeOutBitValue)
        );

    HWREG(baseAddress + captureCompareRegister) &= ~OUT;
    HWREG(baseAddress + captureCompareRegister) |= outputModeOutBitValue;
}

//*****************************************************************************
//
//! Generate a PWM with timer running in up down mode
//!
//! \param baseAddress is the base address of the Timer module.
//! \param clockSource selects Clock source. Valid values are
//!         \b TIMER_CLOCKSOURCE_EXTERNAL_TXCLK
//!         \b TIMER_CLOCKSOURCE_ACLK
//!         \b TIMER_CLOCKSOURCE_SMCLK
//!         \b TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source. Valid values are
//!        \b TIMER_CLOCKSOURCE_DIVIDER_1
//!        \b TIMER_CLOCKSOURCE_DIVIDER_2
//!        \b TIMER_CLOCKSOURCE_DIVIDER_4
//!        \b TIMER_CLOCKSOURCE_DIVIDER_8
//!        \b TIMER_CLOCKSOURCE_DIVIDER_3
//!        \b TIMER_CLOCKSOURCE_DIVIDER_5
//!        \b TIMER_CLOCKSOURCE_DIVIDER_6
//!        \b TIMER_CLOCKSOURCE_DIVIDER_7
//!        \b TIMER_CLOCKSOURCE_DIVIDER_10
//!        \b TIMER_CLOCKSOURCE_DIVIDER_12
//!        \b TIMER_CLOCKSOURCE_DIVIDER_14
//!        \b TIMER_CLOCKSOURCE_DIVIDER_16
//!        \b TIMER_CLOCKSOURCE_DIVIDER_20
//!        \b TIMER_CLOCKSOURCE_DIVIDER_24
//!        \b TIMER_CLOCKSOURCE_DIVIDER_28
//!        \b TIMER_CLOCKSOURCE_DIVIDER_32
//!        \b TIMER_CLOCKSOURCE_DIVIDER_40
//!        \b TIMER_CLOCKSOURCE_DIVIDER_48
//!        \b TIMER_CLOCKSOURCE_DIVIDER_56
//!        \b TIMER_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod selects the desired timer period
//! \param compareRegister selects the compare register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareOutputMode specifies the ouput mode. Valid values are
//!        \b TIMER_OUTPUTMODE_OUTBITVALUE,
//!        \b TIMER_OUTPUTMODE_SET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_RESET,
//!        \b TIMER_OUTPUTMODE_SET_RESET
//!        \b TIMER_OUTPUTMODE_TOGGLE,
//!        \b TIMER_OUTPUTMODE_RESET,
//!        \b TIMER_OUTPUTMODE_TOGGLE_SET,
//!        \b TIMER_OUTPUTMODE_RESET_SET
//! \param dutyCycle specifies the dutycycle for the generated waveform
//!
//! Modified registers are \b TAxCTL, \b TAxCCR0, \b TAxCCTL0,\b TAxCCTLn
//!
//! \return NONE
//
//*****************************************************************************
void Timer_generatePWM (  unsigned int baseAddress,
    unsigned int clockSource,
    unsigned int clockSourceDivider,
    unsigned int timerPeriod,
    unsigned int compareRegister,
    unsigned int compareOutputMode,
    unsigned int dutyCycle
    )
{
    ASSERT(
        (TIMER_CLOCKSOURCE_EXTERNAL_TXCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_ACLK == clockSource) ||
        (TIMER_CLOCKSOURCE_SMCLK == clockSource) ||
        (TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == clockSource)
        );

    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == compareRegister) 
        );


    ASSERT((TIMER_OUTPUTMODE_OUTBITVALUE == compareOutputMode) ||
        (TIMER_OUTPUTMODE_SET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_SET_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE == compareOutputMode) ||
        (TIMER_OUTPUTMODE_RESET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_TOGGLE_SET == compareOutputMode) ||
        (TIMER_OUTPUTMODE_RESET_SET == compareOutputMode)
        );

    privateTimerProcessClockSourceDivider(baseAddress,
        clockSourceDivider
        );

    HWREG(baseAddress + OFS_TAxCTL)  &=
        ~( TIMER_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
           TIMER_UPDOWN_MODE + TIMER_DO_CLEAR +
           TIMER_TAIE_INTERRUPT_ENABLE
           );

    HWREG(baseAddress + OFS_TAxCTL)  |= ( clockSource +
                                          TIMER_UP_MODE +
                                          TIMER_DO_CLEAR
                                          );

