noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/timer.c
    HWREG(baseAddress + OFS_TAxCCR0)  = timerPeriod;

    HWREG(baseAddress + OFS_TAxCCTL0)  &=
        ~(TIMER_CAPTURECOMPARE_INTERRUPT_ENABLE +
          TIMER_OUTPUTMODE_RESET_SET
          );
    HWREG(baseAddress + compareRegister)  |= compareOutputMode;

    HWREG(baseAddress + compareRegister + OFS_TAxR) = dutyCycle;
}

//*****************************************************************************
//
//! Stops the timer
//!
//! \param baseAddress is the base address of the Timer module.
//!
//! Modified registers are \b TAxCTL
//!
//! \returns NONE
//
//*****************************************************************************
void Timer_stop ( unsigned int baseAddress )
{
    HWREG(baseAddress + OFS_TAxCTL)  &= ~MC_3;
    HWREG(baseAddress + OFS_TAxCTL)  |= MC_0;
}

//*****************************************************************************
//
//! Private clock source divider helper function
//!
//! \param baseAddress is the base address of the Timer module.
//! \param clockSourceDivider is the desired divider for the clock source
//!
//! Modified registers are TAxEX0, TAxCTL
//!
//! \returns NONE
//
//*****************************************************************************
void privateTimerProcessClockSourceDivider (unsigned int baseAddress,
    unsigned int clockSourceDivider)
{
    HWREG(baseAddress + OFS_TAxCTL) &= ~ID__8;
    HWREG(baseAddress + OFS_TAxEX0) &= ~TAIDEX_7;
    switch (clockSourceDivider){
        case TIMER_CLOCKSOURCE_DIVIDER_1:
        case TIMER_CLOCKSOURCE_DIVIDER_2:
        case TIMER_CLOCKSOURCE_DIVIDER_4:
        case TIMER_CLOCKSOURCE_DIVIDER_8:
            HWREG(baseAddress + OFS_TAxCTL) |= ((clockSourceDivider - 1) << 6);
            HWREG(baseAddress + OFS_TAxEX0) = TAIDEX_0;
            break;

        case TIMER_CLOCKSOURCE_DIVIDER_3:
        case TIMER_CLOCKSOURCE_DIVIDER_5:
        case TIMER_CLOCKSOURCE_DIVIDER_6:
        case TIMER_CLOCKSOURCE_DIVIDER_7:
            HWREG(baseAddress + OFS_TAxCTL) |= ID__1;
            HWREG(baseAddress + OFS_TAxEX0) = (clockSourceDivider - 1);
            break;

        case TIMER_CLOCKSOURCE_DIVIDER_10:
        case TIMER_CLOCKSOURCE_DIVIDER_12:
        case TIMER_CLOCKSOURCE_DIVIDER_14:
        case TIMER_CLOCKSOURCE_DIVIDER_16:
            HWREG(baseAddress + OFS_TAxCTL) |= ID__2;
            HWREG(baseAddress + OFS_TAxEX0) = (clockSourceDivider / 2 - 1 );
            break;

        case TIMER_CLOCKSOURCE_DIVIDER_20:
        case TIMER_CLOCKSOURCE_DIVIDER_24:
        case TIMER_CLOCKSOURCE_DIVIDER_28:
        case TIMER_CLOCKSOURCE_DIVIDER_32:
            HWREG(baseAddress + OFS_TAxCTL) |= ID__4;
            HWREG(baseAddress + OFS_TAxEX0) = (clockSourceDivider / 4 - 1);
            break;
        case TIMER_CLOCKSOURCE_DIVIDER_40:
        case TIMER_CLOCKSOURCE_DIVIDER_48:
        case TIMER_CLOCKSOURCE_DIVIDER_56:
        case TIMER_CLOCKSOURCE_DIVIDER_64:
            HWREG(baseAddress + OFS_TAxCTL) |= ID__8;
            HWREG(baseAddress + OFS_TAxEX0) = (clockSourceDivider / 8 - 1);
            break;
    }
}

//*****************************************************************************
//
//! Sets the value of the capture-compare register
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureRegister selects the Capture register being used. Valid values
//!     are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified register is \b TAxCCRn
//!
//! \return NONE
//
//*****************************************************************************
void Timer_setCompareValue (  unsigned int baseAddress,
    unsigned int compareRegister,
    unsigned int compareValue
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == compareRegister) 
        );

    HWREG(baseAddress + compareRegister + OFS_TAxR) = compareValue;
}

//*****************************************************************************
//
//! Clears the Timer TAIFG interrupt flag
//!
//! \param baseAddress is the base address of the Timer module.
//!
//! Modified bits are TAIFG og TAxCTL register
//!
//! \return NONE
//
//*****************************************************************************
void Timer_clearTimerInterruptFlag (unsigned int baseAddress)
{
    HWREGB(baseAddress + OFS_TAxCTL) &= ~TAIFG;
}

//*****************************************************************************
//
//! Clears the capture-compare interrupt flag
//!
//! \param baseAddress is the base address of the Timer module.
//! \param captureCompareRegister selects the Capture-compare register being
//! used. Valid values are
//!     \b TIMER_CAPTURECOMPARE_REGISTER_0
//!     \b TIMER_CAPTURECOMPARE_REGISTER_1
//!     \b TIMER_CAPTURECOMPARE_REGISTER_2
//!     \b TIMER_CAPTURECOMPARE_REGISTER_3
//!     \b TIMER_CAPTURECOMPARE_REGISTER_4
//!     \b TIMER_CAPTURECOMPARE_REGISTER_5
//!     \b TIMER_CAPTURECOMPARE_REGISTER_6
//!    Refer datasheet to ensure the device has the capture compare register
//!    being used
//!
//! Modified bits are CCIFG of \b TAxCCTLn register
//!
//! \return NONE
//
//*****************************************************************************
void Timer_clearCaptureCompareInterruptFlag (unsigned int baseAddress,
    unsigned int captureCompareRegister
    )
{
    ASSERT((TIMER_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
        (TIMER_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister) 
        );

    HWREG(baseAddress + captureCompareRegister)  &= ~CCIFG;
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
